# Initialize

tap "'caskroom/homebrew-cask'"
tap "'homebrew/versions'"
tap "'homebrew/science'"
tap "'homebrew/brewdler'"
tap "'caskroom/versions'"
tap "'ravenac95/sudolikeaboss'"
tap "'aereal/homebrew-aereal_casks'"
tap "'mrkn/mrkn_casks'"

# Basic packages

brew "brew-cask"
brew "gcc", args: %w[with-all-languages with-jit]
brew "lv"
brew "ag"
brew "git"
brew "tig"
brew "hub"
brew "csshx"
brew "autossh"
brew "tree"
brew "tmux"
brew "reattach-to-user-namespace"
brew "xz"
brew "sudolikeaboss"
brew "direnv"

cask "keyremap4macbook"
cask "aquaskk"
cask "showy-edge"
cask "alfred"
cask "bartender"
cask "iterm2-beta"
cask "macvim-kaoriya"
cask "istat-menus"
cask "insomnia-x"
cask "soundflower"
cask "dropbox"
cask "airdisplay"
cask "gpgtools"
cask "dterm"
cask "xquartz"
cask "dterm"

# Utilities

brew "peco"
brew "imagemagick"
brew "elasticsearch"
brew "libdvdcss"
brew "ffmpeg", args: %w[with-freetype with-libass with-libbluray with-libcaca with-libquvi with-libvidstab with-libvo-aacenc with-libvorbis with-libvpx with-opencore-amr with-openjpeg with-openssl with-opus with-rtmpdump with-schroedinger with-speex with-theora with-tools with-x265]

system "brew pull 'https://github.com/Homebrew/homebrew/pull/25953'"
brew "pdftk"
brew "poppler"
brew "sam2p"

cask "cyberduck"
cask "omnigraffle"
cask "send-to-kindle"
cask "flip4mac"
cask "mactex"
cask "bathyscaphe"
cask "vlc"
cask "calibre"
cask "anki"
cask "adobe-reader"
cask "skype"
cask "hipchat"
cask "quartz-clocks"
cask "licecap"
cask "flash"
cask "trailer"
cask "keyboard-cleaner"
cask "handbrake"
cask "disk-inventory-x"

# "Development" packages

brew "phantomjs"
brew "haskell-platform"
brew "erlang", args: %w[devel]
brew "elixir"
brew "openblas", args: %w[build-from-source]
brew "r", args: %w[with-openblas]
brew "octave", args: %w[with-docs with-openblas]
brew "postgresql"
brew "mysql"
brew "redis"
brew "mecab"
brew "pyenv"
brew "homebrew/boneyard/pyenv-pip-rehash"
brew "plenv"
brew "perl-build"

cask "firefox"
cask "java"
cask "rstudio"
cask "pharo"
cask "sequel-pro"
cask "emacs"
cask "julia"
cask "genymotion"

# "VMs"

cask "vmware-fusion"
cask "virtualbox"
cask "vagrant"
